<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"1bd54cb722d249a77e1c408925e841ce60b37db8d75c08e8c547e5b0a5bf8897","plan_job_ref":"Job Pull Request Quality Checks #19 at https://github.com/sudoblark/sudoblark.terraform.modularised-demo/actions/runs/23052597384","plan_out_hash":"70a11e148c487a2594b746bb5fd1e7b3e858e5ebd6f9c18658a7577f0ad6f119","plan_hash":"8a186bef7dd7e48bf14b53be4c597731ab5e05e5452268a5437c062543a9c637","plan_text_format":"diff","version":"2.2.3"} -->
Terraform plan in __./infrastructure/aws-sudoblark-development__
<details>
<summary>Plan: 29 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_glue_data_catalog_encryption_settings.catalog_encryption will be created
+   resource "aws_glue_data_catalog_encryption_settings" "catalog_encryption" {
+       catalog_id = (known after apply)
+       id         = (known after apply)
+       region     = "eu-west-2"

+       data_catalog_encryption_settings {
+           connection_password_encryption {
+               aws_kms_key_id                       = "***************************************************************************"
+               return_connection_password_encrypted = true
            }
+           encryption_at_rest {
+               catalog_encryption_mode = "SSE-KMS"
+               sse_aws_kms_key_id      = "***************************************************************************"
            }
        }
    }

  # aws_servicecatalogappregistry_application.demo will be created
+   resource "aws_servicecatalogappregistry_application" "demo" {
+       application_tag = (known after apply)
+       arn             = (known after apply)
+       description     = "Application created by Terraform for the tf-micro-repo application in the sudoblark-development account as part of the demos project."
+       id              = (known after apply)
+       name            = "sudoblark-development-demos-tf-micro-repo"
+       region          = "eu-west-2"
+       tags_all        = {
+           "environment" = "development"
+           "managed_by"  = "sudoblark.terraform.modularised-demo"
        }
    }

  # module.athena_workgroups["analytics-workgroup"].aws_athena_workgroup.workgroup will be created
+   resource "aws_athena_workgroup" "workgroup" {
+       arn           = (known after apply)
+       description   = "Workgroup for querying processed ETL pipeline data"
+       force_destroy = false
+       id            = (known after apply)
+       name          = "sudoblark-development-demos-tf-micro-repo-analytics-workgroup"
+       region        = "eu-west-2"
+       state         = "ENABLED"
+       tags_all      = {
+           "environment" = "development"
+           "managed_by"  = "sudoblark.terraform.modularised-demo"
        }

+       configuration {
+           enable_minimum_encryption_configuration = (known after apply)
+           enforce_workgroup_configuration         = true
+           publish_cloudwatch_metrics_enabled      = true
+           requester_pays_enabled                  = false

+           result_configuration {
+               output_location = "s3://sudoblark-development-demos-tf-micro-repo-athena-results/"

+               encryption_configuration {
+                   encryption_option = "SSE_S3"
                }
            }
        }
    }

  # module.glue_crawlers["processed-data-crawler"].aws_glue_crawler.crawler will be created
+   resource "aws_glue_crawler" "crawler" {
+       arn                    = (known after apply)
+       configuration          = jsonencode(
            {
+               Grouping = {
+                   TableGroupingPolicy = "CombineCompatibleSchemas"
                }
+               Version  = 1
            }
        )
+       database_name          = "sudoblark-development-demos-tf-micro-repo-analytics"
+       description            = "Automatically discovers schema and partitions from processed Parquet files"
+       id                     = (known after apply)
+       name                   = "sudoblark-development-demos-tf-micro-repo-processed-data-crawler"
+       region                 = "eu-west-2"
+       role                   = "arn:aws:iam::796012663443:role/sudoblark-dev-demos-tf-micro-glue-crawler-role"
+       schedule               = "cron(0 2 * * ? *)"
+       security_configuration = "sudoblark-development-demos-tf-micro-repo-processed-data-crawler-security-config"
+       tags_all               = {
+           "environment" = "development"
+           "managed_by"  = "sudoblark.terraform.modularised-demo"
        }
#        (1 unchanged attribute hidden)

+       s3_target {
+           path = "s3://sudoblark-development-demos-tf-micro-repo-processed"
        }

+       schema_change_policy {
+           delete_behavior = "LOG"
+           update_behavior = "UPDATE_IN_DATABASE"
        }
    }

  # module.glue_crawlers["processed-data-crawler"].aws_glue_security_configuration.security_config will be created
+   resource "aws_glue_security_configuration" "security_config" {
+       id     = (known after apply)
+       name   = "sudoblark-development-demos-tf-micro-repo-processed-data-crawler-security-config"
+       region = "eu-west-2"

+       encryption_configuration {
+           cloudwatch_encryption {
+               cloudwatch_encryption_mode = "DISABLED"
            }
+           job_bookmarks_encryption {
+               job_bookmarks_encryption_mode = "DISABLED"
            }
+           s3_encryption {
+               s3_encryption_mode = "SSE-S3"
            }
        }
    }

  # module.glue_databases["analytics"].aws_glue_catalog_database.database will be created
+   resource "aws_glue_catalog_database" "database" {
+       arn          = (known after apply)
+       catalog_id   = "************"
+       description  = "Analytics database for processed ETL pipeline data"
+       id           = (known after apply)
+       location_uri = (known after apply)
+       name         = "sudoblark-development-demos-tf-micro-repo-analytics"
+       region       = "eu-west-2"
+       tags_all     = {
+           "environment" = "development"
+           "managed_by"  = "sudoblark.terraform.modularised-demo"
        }

+       create_table_default_permission (known after apply)
    }

  # module.iam["glue-crawler-role"].aws_iam_role.role["glue-crawler-role"] will be created
+   resource "aws_iam_role" "role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = [
+                               "glue.amazonaws.com",
                            ]
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "sudoblark-dev-demos-tf-micro-glue-crawler-role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "environment" = "development"
+           "managed_by"  = "sudoblark.terraform.modularised-demo"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.iam["glue-crawler-role"].aws_iam_role_policy.inline_policy["glue-crawler-role-s3-glue-access"] will be created
+   resource "aws_iam_role_policy" "inline_policy" {
+       id          = (known after apply)
+       name        = "s3-glue-access"
+       name_prefix = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:GetObject",
+                           "s3:PutObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::sudoblark-development-demos-tf-micro-repo-processed/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:ListBucket",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::sudoblark-development-demos-tf-micro-repo-processed",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role        = (known after apply)
    }

  # module.iam["glue-crawler-role"].aws_iam_role_policy_attachment.managed_policy["glue-crawler-role-arn-aws-iam--aws-policy-service-role-AWSGlueServiceRole"] will be created
+   resource "aws_iam_role_policy_attachment" "managed_policy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole"
+       role       = "sudoblark-dev-demos-tf-micro-glue-crawler-role"
    }

  # module.iam["parquet-converter-role"].aws_iam_role.role["parquet-converter-role"] will be created
+   resource "aws_iam_role" "role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = [
+                               "lambda.amazonaws.com",
                            ]
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "sudoblark-dev-demos-tf-micro-parquet-converter-role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "environment" = "development"
+           "managed_by"  = "sudoblark.terraform.modularised-demo"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.iam["parquet-converter-role"].aws_iam_role_policy.inline_policy["parquet-converter-role-s3-access"] will be created
+   resource "aws_iam_role_policy" "inline_policy" {
+       id          = (known after apply)
+       name        = "s3-access"
+       name_prefix = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:GetObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::sudoblark-development-demos-tf-micro-repo-raw/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:PutObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::sudoblark-development-demos-tf-micro-repo-processed/*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role        = (known after apply)
    }

  # module.iam["parquet-converter-role"].aws_iam_role_policy_attachment.managed_policy["parquet-converter-role-arn-aws-iam--aws-policy-service-role-AWSLambdaBasicExecutionRole"] will be created
+   resource "aws_iam_role_policy_attachment" "managed_policy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
+       role       = "sudoblark-dev-demos-tf-micro-parquet-converter-role"
    }

  # module.iam["unzip-processor-role"].aws_iam_role.role["unzip-processor-role"] will be created
+   resource "aws_iam_role" "role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = [
+                               "lambda.amazonaws.com",
                            ]
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "sudoblark-dev-demos-tf-micro-unzip-processor-role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "environment" = "development"
+           "managed_by"  = "sudoblark.terraform.modularised-demo"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.iam["unzip-processor-role"].aws_iam_role_policy.inline_policy["unzip-processor-role-s3-access"] will be created
+   resource "aws_iam_role_policy" "inline_policy" {
+       id          = (known after apply)
+       name        = "s3-access"
+       name_prefix = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:GetObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::sudoblark-development-demos-tf-micro-repo-landing/*",
                        ]
                    },
+                   {
+                       Action   = [
+                           "s3:PutObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::sudoblark-development-demos-tf-micro-repo-raw/*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role        = (known after apply)
    }

  # module.iam["unzip-processor-role"].aws_iam_role_policy_attachment.managed_policy["unzip-processor-role-arn-aws-iam--aws-policy-service-role-AWSLambdaBasicExecutionRole"] will be created
+   resource "aws_iam_role_policy_attachment" "managed_policy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
+       role       = "sudoblark-dev-demos-tf-micro-unzip-processor-role"
    }

  # module.lambdas["parquet-converter"].aws_lambda_function.function will be created
+   resource "aws_lambda_function" "function" {
+       architectures                  = (known after apply)
+       arn                            = (known after apply)
+       code_sha256                    = (known after apply)
+       description                    = "Converts CSV files from raw to parquet in processed bucket"
+       filename                       = "../../lambda-packages/parquet-converter.zip"
+       function_name                  = "sudoblark-development-demos-tf-micro-repo-parquet-converter"
+       handler                        = "lambda_function.handler"
+       id                             = (known after apply)
+       invoke_arn                     = (known after apply)
+       last_modified                  = (known after apply)
+       layers                         = [
+           "arn:aws:lambda:eu-west-2:336392948345:layer:AWSSDKPandas-Python311:11",
        ]
+       memory_size                    = 1024
+       package_type                   = "Zip"
+       publish                        = false
+       qualified_arn                  = (known after apply)
+       qualified_invoke_arn           = (known after apply)
+       region                         = "eu-west-2"
+       reserved_concurrent_executions = -1
+       response_streaming_invoke_arn  = (known after apply)
+       role                           = "arn:aws:iam::796012663443:role/sudoblark-dev-demos-tf-micro-parquet-converter-role"
+       runtime                        = "python3.11"
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       skip_destroy                   = false
+       source_code_hash               = "RG+klAWju6YbOTZERsnkIBF6koFBOHxVfikoLA+VH6w="
+       source_code_size               = (known after apply)
+       tags_all                       = {
+           "environment" = "development"
+           "managed_by"  = "sudoblark.terraform.modularised-demo"
        }
+       timeout                        = 120
+       version                        = (known after apply)

+       environment {
+           variables = {
+               "LOG_LEVEL"        = "INFO"
+               "PROCESSED_BUCKET" = "processed"
            }
        }

+       ephemeral_storage (known after apply)

+       logging_config (known after apply)

+       tracing_config (known after apply)
    }

  # module.lambdas["unzip-processor"].aws_lambda_function.function will be created
+   resource "aws_lambda_function" "function" {
+       architectures                  = (known after apply)
+       arn                            = (known after apply)
+       code_sha256                    = (known after apply)
+       description                    = "Extracts ZIP files from landing bucket to raw bucket"
+       filename                       = "../../lambda-packages/unzip-processor.zip"
+       function_name                  = "sudoblark-development-demos-tf-micro-repo-unzip-processor"
+       handler                        = "lambda_function.handler"
+       id                             = (known after apply)
+       invoke_arn                     = (known after apply)
+       last_modified                  = (known after apply)
+       layers                         = []
+       memory_size                    = 512
+       package_type                   = "Zip"
+       publish                        = false
+       qualified_arn                  = (known after apply)
+       qualified_invoke_arn           = (known after apply)
+       region                         = "eu-west-2"
+       reserved_concurrent_executions = -1
+       response_streaming_invoke_arn  = (known after apply)
+       role                           = "arn:aws:iam::796012663443:role/sudoblark-dev-demos-tf-micro-unzip-processor-role"
+       runtime                        = "python3.11"
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       skip_destroy                   = false
+       source_code_hash               = "I45zETSQY2IkXWSPhe9elL67yAEDLnix8m9cyRAyOMA="
+       source_code_size               = (known after apply)
+       tags_all                       = {
+           "environment" = "development"
+           "managed_by"  = "sudoblark.terraform.modularised-demo"
        }
+       timeout                        = 60
+       version                        = (known after apply)

+       environment {
+           variables = {
+               "LOG_LEVEL"  = "INFO"
+               "RAW_BUCKET" = "raw"
            }
        }

+       ephemeral_storage (known after apply)

+       logging_config (known after apply)

+       tracing_config (known after apply)
    }

  # module.s3_buckets["athena-results"].aws_s3_bucket.bucket will be created
+   resource "aws_s3_bucket" "bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "sudoblark-development-demos-tf-micro-repo-athena-results"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_region               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = "eu-west-2"
+       request_payer               = (known after apply)
+       tags_all                    = {
+           "environment" = "development"
+           "managed_by"  = "sudoblark.terraform.modularised-demo"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # module.s3_buckets["athena-results"].aws_s3_bucket_public_access_block.bucket will be created
+   resource "aws_s3_bucket_public_access_block" "bucket" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       region                  = "eu-west-2"
+       restrict_public_buckets = true
    }

  # module.s3_buckets["landing"].aws_s3_bucket.bucket will be created
+   resource "aws_s3_bucket" "bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "sudoblark-development-demos-tf-micro-repo-landing"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_region               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = "eu-west-2"
+       request_payer               = (known after apply)
+       tags_all                    = {
+           "environment" = "development"
+           "managed_by"  = "sudoblark.terraform.modularised-demo"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # module.s3_buckets["landing"].aws_s3_bucket_public_access_block.bucket will be created
+   resource "aws_s3_bucket_public_access_block" "bucket" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       region                  = "eu-west-2"
+       restrict_public_buckets = true
    }

  # module.s3_buckets["processed"].aws_s3_bucket.bucket will be created
+   resource "aws_s3_bucket" "bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "sudoblark-development-demos-tf-micro-repo-processed"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_region               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = "eu-west-2"
+       request_payer               = (known after apply)
+       tags_all                    = {
+           "environment" = "development"
+           "managed_by"  = "sudoblark.terraform.modularised-demo"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # module.s3_buckets["processed"].aws_s3_bucket_public_access_block.bucket will be created
+   resource "aws_s3_bucket_public_access_block" "bucket" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       region                  = "eu-west-2"
+       restrict_public_buckets = true
    }

  # module.s3_buckets["raw"].aws_s3_bucket.bucket will be created
+   resource "aws_s3_bucket" "bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "sudoblark-development-demos-tf-micro-repo-raw"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_region               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = "eu-west-2"
+       request_payer               = (known after apply)
+       tags_all                    = {
+           "environment" = "development"
+           "managed_by"  = "sudoblark.terraform.modularised-demo"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # module.s3_buckets["raw"].aws_s3_bucket_public_access_block.bucket will be created
+   resource "aws_s3_bucket_public_access_block" "bucket" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       region                  = "eu-west-2"
+       restrict_public_buckets = true
    }

  # module.s3_notifications["landing"].aws_lambda_permission.allow_s3_invoke["0"] will be created
+   resource "aws_lambda_permission" "allow_s3_invoke" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "arn:aws:lambda:eu-west-2:796012663443:function:sudoblark-development-demos-tf-micro-repo-unzip-processor"
+       id                  = (known after apply)
+       principal           = "s3.amazonaws.com"
+       region              = "eu-west-2"
+       source_arn          = "arn:aws:s3:::sudoblark-development-demos-tf-micro-repo-landing"
+       statement_id        = "************************************************************************"
+       statement_id_prefix = (known after apply)
    }

  # module.s3_notifications["landing"].aws_s3_bucket_notification.notification will be created
+   resource "aws_s3_bucket_notification" "notification" {
+       bucket      = "sudoblark-development-demos-tf-micro-repo-landing"
+       eventbridge = false
+       id          = (known after apply)
+       region      = "eu-west-2"

+       lambda_function {
+           events              = [
+               "s3:ObjectCreated:*",
            ]
+           filter_suffix       = ".zip"
+           id                  = (known after apply)
+           lambda_function_arn = "arn:aws:lambda:eu-west-2:796012663443:function:sudoblark-development-demos-tf-micro-repo-unzip-processor"
#            (1 unchanged attribute hidden)
        }
    }

  # module.s3_notifications["raw"].aws_lambda_permission.allow_s3_invoke["0"] will be created
+   resource "aws_lambda_permission" "allow_s3_invoke" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "arn:aws:lambda:eu-west-2:796012663443:function:sudoblark-development-demos-tf-micro-repo-parquet-converter"
+       id                  = (known after apply)
+       principal           = "s3.amazonaws.com"
+       region              = "eu-west-2"
+       source_arn          = "arn:aws:s3:::sudoblark-development-demos-tf-micro-repo-raw"
+       statement_id        = "********************************************************************"
+       statement_id_prefix = (known after apply)
    }

  # module.s3_notifications["raw"].aws_s3_bucket_notification.notification will be created
+   resource "aws_s3_bucket_notification" "notification" {
+       bucket      = "sudoblark-development-demos-tf-micro-repo-raw"
+       eventbridge = false
+       id          = (known after apply)
+       region      = "eu-west-2"

+       lambda_function {
+           events              = [
+               "s3:ObjectCreated:*",
            ]
+           filter_suffix       = ".csv"
+           id                  = (known after apply)
+           lambda_function_arn = "arn:aws:lambda:eu-west-2:796012663443:function:sudoblark-development-demos-tf-micro-repo-parquet-converter"
#            (1 unchanged attribute hidden)
        }
    }

Plan: 29 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   iam_roles        = {
+       glue-crawler-role      = {
+           role_arn  = (known after apply)
+           role_id   = (known after apply)
+           role_name = "sudoblark-dev-demos-tf-micro-glue-crawler-role"
        }
+       parquet-converter-role = {
+           role_arn  = (known after apply)
+           role_id   = (known after apply)
+           role_name = "sudoblark-dev-demos-tf-micro-parquet-converter-role"
        }
+       unzip-processor-role   = {
+           role_arn  = (known after apply)
+           role_id   = (known after apply)
+           role_name = "sudoblark-dev-demos-tf-micro-unzip-processor-role"
        }
    }
+   lambda_functions = {
+       parquet-converter = {
+           function_arn  = (known after apply)
+           function_name = "sudoblark-development-demos-tf-micro-repo-parquet-converter"
+           invoke_arn    = (known after apply)
+           qualified_arn = (known after apply)
+           version       = (known after apply)
        }
+       unzip-processor   = {
+           function_arn  = (known after apply)
+           function_name = "sudoblark-development-demos-tf-micro-repo-unzip-processor"
+           invoke_arn    = (known after apply)
+           qualified_arn = (known after apply)
+           version       = (known after apply)
        }
    }
+   s3_buckets       = {
+       athena-results = {
+           bucket_arn                  = (known after apply)
+           bucket_domain_name          = (known after apply)
+           bucket_name                 = (known after apply)
+           bucket_regional_domain_name = (known after apply)
        }
+       landing        = {
+           bucket_arn                  = (known after apply)
+           bucket_domain_name          = (known after apply)
+           bucket_name                 = (known after apply)
+           bucket_regional_domain_name = (known after apply)
        }
+       processed      = {
+           bucket_arn                  = (known after apply)
+           bucket_domain_name          = (known after apply)
+           bucket_name                 = (known after apply)
+           bucket_regional_domain_name = (known after apply)
        }
+       raw            = {
+           bucket_arn                  = (known after apply)
+           bucket_domain_name          = (known after apply)
+           bucket_name                 = (known after apply)
+           bucket_regional_domain_name = (known after apply)
        }
    }
+   s3_notifications = {
+       landing = {
+           notification_id = (known after apply)
        }
+       raw     = {
+           notification_id = (known after apply)
        }
    }

Warning: Deprecated attribute

  on ../../modules/data/infrastructure.tf line 70, in locals:
  70:               lambda_function_arn = "arn:aws:lambda:${data.aws_region.current.name}:${data.aws_caller_identity.current.account_id}:function:${local.lambdas_map[lambda_notif.lambda_name].full_name}"

The attribute "name" is deprecated. Refer to the provider documentation for
details.
```
</details>

:memo: Plan generated in [Pull Request Quality Checks #19](https://github.com/sudoblark/sudoblark.terraform.modularised-demo/actions/runs/23052597384)